-- 招募使

local tbChuanmushi	= Npc:GetClass("zhaomushi");

tbChuanmushi.tbBattleSeq = {"一", "二", "三"};

tbChuanmushi.TBFACTIONEQUIP = 
{
	{--初级战场，扬州战场
		[1] = 49, -- 少林
		[2] = 50, --天王掌门
		[3] = 51, --唐门掌门
		[4] = 53, --五毒掌门
		[5] = 55, --峨嵋掌门
		[6] = 56, --翠烟掌门
		[7] = 58, --丐帮掌门
		[8] = 57, --天忍掌门
		[9] = 59, --武当掌门
		[10] = 60, --昆仑掌门
		[11] = 52, --明教掌门
		[12] = 54, --大理段氏掌门
	},
	{--中级战场，凤翔战场
		[1] = 61, -- 少林
		[2] = 62, --天王掌门
		[3] = 63, --唐门掌门
		[4] = 65, --五毒掌门
		[5] = 67, --峨嵋掌门
		[6] = 68, --翠烟掌门
		[7] = 70, --丐帮掌门
		[8] = 69, --天忍掌门
		[9] = 71, --武当掌门
		[10] = 72, --昆仑掌门
		[11] = 64, --明教掌门
		[12] = 66, --大理段氏掌门
	},
};

-- 功能 玩家通过和招募使对话,传送至对应的阵营报名点
-- 参数:	szCamp 招募使代表的阵营(song/jin)
function tbChuanmushi:OnDialog(szCamp)													-- 等级不够时
Dialog:Say("NPC chưa mở!");
end
